sdaiFindInstanceTypeOf(Sdai_instS*,Sdai_Id_aggr*)
\details
Retrieves the identifier of all SdaiNamedType data dictionary
instances of which the specified entity instance is a member.
\param instance [in] Identifier of the entity instance whose types are requested.
\param resultList [in/out]  Identifier of the pre-existing NPL to which which the SdaiNamedType instance
identifiers for those dictionary instances are added meeting the specified criteria.
\returns Identifier of the result NPL.